УТ/src/Catalogs/CRM_ВариантыВиджетов/CRM_ВариантыВиджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ВариантыВиджетов</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Виджет</name>
    <type>
      <types>CatalogRef.CRM_Виджеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиВарианта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОбновления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоДляАвтора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/Enums/CRM_ТипыИсточниковДанныхВиджетов/CRM_ТипыИсточниковДанныхВиджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ТипыИсточниковДанныхВиджетов</name>
  <enumValues>
    <name>КлючевойПоказатель</name>
  </enumValues>
  <enumValues>
    <name>ВоронкаПродаж</name>
  </enumValues>
  <enumValues>
    <name>ДинамикаПродаж</name>
  </enumValues>
  <enumValues>
    <name>ДебиторскаяЗадолженность</name>
  </enumValues>
  <enumValues>
    <name>ДинамикаСтатусовКлиентов</name>
  </enumValues>
  <enumValues>
    <name>СтатистикаТелефонныхЗвонков</name>
  </enumValues>
  <enumValues>
    <name>ТрудозатратыВремениПоВидамРабот</name>
  </enumValues>
</mdclass:Enum>

УТ/src/Catalogs/CRM_ВариантыВиджетов/Forms/ФормаВыбора/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции модуля формы "Справочники.CRM_ВариантыВиджетов.Форма.ФормаВыбора".
//
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВариантРаботыВиджетов") Тогда
		
		ВариантРаботыВиджетов = Параметры.ВариантРаботыВиджетов;
		
		// Список.Используется.
		CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(
			Список, "Используется", Истина, ВидСравненияКомпоновкиДанных.Равно);
		
		// Список.ГруппиИЛИ
		ГруппировкаЭлементовОтбора = CRM_ОбщегоНазначенияКлиентСервер.УстановитьГруппуОтбораСписка(
			Список, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		
		// Список.ГруппиИЛИ.Автор
		CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(
			Список, "Автор", Пользователи.ТекущийПользователь(), ВидСравненияКомпоновкиДанных.Равно, ГруппировкаЭлементовОтбора);
		
		// Список.ГруппиИЛИ.ТолькоДляАвтора
		CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(
			Список, "ТолькоДляАвтора", Ложь, ВидСравненияКомпоновкиДанных.Равно, ГруппировкаЭлементовОтбора);
		
		Если Параметры.Свойство("ИсключаемыеВариантыВиджетов") Тогда
			
			// Список.Ссылка
			CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(
				Список, "Ссылка", Параметры.ИсключаемыеВариантыВиджетов, ВидСравненияКомпоновкиДанных.НеВСписке);
			
		КонецЕсли;
		
		Если ВариантРаботыВиджетов = "РабочийСтол" Тогда
			
			CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(
				Список,
				"Ссылка.Виджет.ТипИсточникаДанных",
				Перечисления.CRM_ТипыИсточниковДанныхВиджетов.КлючевойПоказатель,
				ВидСравненияКомпоновкиДанных.Равно);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
